# RemoveConnectorLinksWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..RemoveConnectorLinksWarn Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
The links between connector [Index] and connector [Index], connector [Index] and connector [Index] are removed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RemoveConnectorLinksWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RemoveConnectorLinksWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RemoveConnectorLinksWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace